public/tools/bash.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-31 Tue 13:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="/org"> HOME </a>
</div><div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf93c7bd">1. Downloading</a>
<ul>
<li><a href="#orga49d6f6">1.1. Download a whole webpage</a></li>
<li><a href="#org4fa8f6b">1.2. Download all files from an Apache listing</a></li>
</ul>
</li>
<li><a href="#orgd1bea3a">2. Parameter expansion</a>
<ul>
<li><a href="#org3909de6">2.1. Substring</a></li>
<li><a href="#orge329750">2.2. Replace a string</a></li>
<li><a href="#org9092ca8">2.3. Change case</a></li>
<li><a href="#org99cd675">2.4. Parameters</a></li>
<li><a href="#org969f612">2.5. Filenames</a></li>
</ul>
</li>
<li><a href="#org5c5ee2a">3. Replace text in files</a></li>
<li><a href="#org812e3ff">4. Using tput</a>
<ul>
<li><a href="#orge129582">4.1. Color capabilities</a>
<ul>
<li><a href="#orgfa0b0b1">4.1.1. `tput setab [1-7]` – Set a background color using ANSI escape</a></li>
<li><a href="#org95b95ec">4.1.2. `tput setb [1-7]` – Set a background color</a></li>
<li><a href="#orgdde736b">4.1.3. `tput setaf [1-7]` – Set a foreground color using ANSI escape</a></li>
<li><a href="#org2f2e408">4.1.4. `tput setf [1-7]` – Set a foreground Color</a></li>
</ul>
</li>
<li><a href="#orgf56e4e1">4.2. Text capabilities</a>
<ul>
<li><a href="#org7b66ac3">4.2.1. `tput bold` – Set bold mode</a></li>
<li><a href="#org5b6e4ad">4.2.2. `tput dim` – turn on half-bright mode</a></li>
<li><a href="#org20065fe">4.2.3. `tput smul` – begin underline mode</a></li>
<li><a href="#orgb5b80ba">4.2.4. `tput rmul` – exit underline mode</a></li>
<li><a href="#org4d7ba3f">4.2.5. `tput rev` – Turn on reverse mode</a></li>
<li><a href="#org04ae5c9">4.2.6. `tput smso` – Enter standout mode (bold on rxvt)</a></li>
<li><a href="#org8de2524">4.2.7. `tput rmso` – Exit standout mode</a></li>
<li><a href="#org3500a5c">4.2.8. `tput sgr0` – Turn off all attributes</a></li>
</ul>
</li>
<li><a href="#org4cdbeb0">4.3. Color codes</a>
<ul>
<li><a href="#org6acc123">4.3.1. `0` – Black</a></li>
<li><a href="#org8a87ccd">4.3.2. `1` – Red</a></li>
<li><a href="#orga2e0c61">4.3.3. `2` – Green</a></li>
<li><a href="#org47c4ad9">4.3.4. `3` – Yellow</a></li>
<li><a href="#org7da759f">4.3.5. `4` – Blue</a></li>
<li><a href="#orgf6a77d7">4.3.6. `5` – Magenta</a></li>
<li><a href="#org6bf2d12">4.3.7. `6` – Cyan</a></li>
<li><a href="#org19fc77e">4.3.8. `7` – White</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgf93c7bd" class="outline-2">
<h2 id="orgf93c7bd"><span class="section-number-2">1</span> Downloading</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orga49d6f6" class="outline-3">
<h3 id="orga49d6f6"><span class="section-number-3">1.1</span> Download a whole webpage</h3>
<div class="outline-text-3" id="text-1-1">
<pre class="example">
wget --mirror -p --convert-links -P TARGET_PATH http://foobar.com
</pre>
</div>
</div>

<div id="outline-container-org4fa8f6b" class="outline-3">
<h3 id="org4fa8f6b"><span class="section-number-3">1.2</span> Download all files from an Apache listing</h3>
<div class="outline-text-3" id="text-1-2">
<pre class="example">
wget -r -N --no-parent --reject '*index.html*' -nH --cut-dirs=1 http://foobar.com
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd1bea3a" class="outline-2">
<h2 id="orgd1bea3a"><span class="section-number-2">2</span> Parameter expansion</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-org3909de6" class="outline-3">
<h3 id="org3909de6"><span class="section-number-3">2.1</span> Substring</h3>
<div class="outline-text-3" id="text-2-1">
<pre class="example">
var="abcdef"
echo ${var:1:3} # bcd
</pre>
</div>
</div>

<div id="outline-container-orge329750" class="outline-3">
<h3 id="orge329750"><span class="section-number-3">2.2</span> Replace a string</h3>
<div class="outline-text-3" id="text-2-2">
<pre class="example">
var="apples and cherries"
echo ${var/apples/cherries} # cherries and cherries
</pre>

<p>
<b>Global substitution</b>
</p>
<pre class="example">
var="apples and apples and cherries"
echo ${var//apples/cherries} # cherries and cherries and cherries
</pre>

<p>
<b>Remove substring</b>
</p>
<pre class="example">
var="apples and cherries"
echo ${var/apples/} #  and cherries
</pre>

<p>
<b>Remove pattern from end of a string</b>
</p>
<pre class="example">
var="apples and cherries"
echo${car%cherries} # apples and
</pre>
</div>
</div>

<div id="outline-container-org9092ca8" class="outline-3">
<h3 id="org9092ca8"><span class="section-number-3">2.3</span> Change case</h3>
<div class="outline-text-3" id="text-2-3">
<pre class="example">
var="abcdef"
echo ${var^^} # ABCDEF
</pre>
<pre class="example">
var="ABCDEF"
echo ${var,,} # abcdef
</pre>
<p>
<b>Lowercase all filenames</b>
</p>
<pre class="example">
for i in *.JPG; do
  mv "$i" "${i,,}"
done
</pre>
</div>
</div>
<div id="outline-container-org99cd675" class="outline-3">
<h3 id="org99cd675"><span class="section-number-3">2.4</span> Parameters</h3>
<div class="outline-text-3" id="text-2-4">
<p>
<b>Access given parameter</b>
</p>
<pre class="example">
echo ${@:3} # prints the 3rd parameter provided to the script
</pre>
</div>
</div>
<div id="outline-container-org969f612" class="outline-3">
<h3 id="org969f612"><span class="section-number-3">2.5</span> Filenames</h3>
<div class="outline-text-3" id="text-2-5">
<p>
<b>Print a filename without the extension</b>
</p>
<pre class="example">
var=file.txt
echo ${var%.*}
</pre>

<p>
<b>Print only an extension</b>
</p>
<pre class="example">
var=file.txt
echo ${var#*.}
</pre>

<p>
<b>Print last segments of a path</b>
</p>
<pre class="example">
var="/usr/bin/emacs"
echo ${var##*/} # emacs
</pre>

<p>
<b>Print the preceding segments of a path</b>
</p>
<pre class="example">
var="/usr/bin/emacs"
echo${var%/*} # /usr/bin
</pre>
</div>
</div>
</div>
<div id="outline-container-org5c5ee2a" class="outline-2">
<h2 id="org5c5ee2a"><span class="section-number-2">3</span> Replace text in files</h2>
<div class="outline-text-2" id="text-3">
<p>
To replace some text in specified files:
</p>
<pre class="example">
grep -nl "foo"  *.go | xargs sed -i 's/foo/bar/g'
</pre>

<p>
recursively:
</p>
<pre class="example">
grep -rl "foo"  *.go | xargs sed -i 's/foo/bar/g'
</pre>
</div>
</div>

<div id="outline-container-org812e3ff" class="outline-2">
<h2 id="org812e3ff"><span class="section-number-2">4</span> Using tput</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-orge129582" class="outline-3">
<h3 id="orge129582"><span class="section-number-3">4.1</span> Color capabilities</h3>
<div class="outline-text-3" id="text-4-1">
</div><div id="outline-container-orgfa0b0b1" class="outline-4">
<h4 id="orgfa0b0b1"><span class="section-number-4">4.1.1</span> `tput setab [1-7]` – Set a background color using ANSI escape</h4>
</div>
<div id="outline-container-org95b95ec" class="outline-4">
<h4 id="org95b95ec"><span class="section-number-4">4.1.2</span> `tput setb [1-7]` – Set a background color</h4>
</div>
<div id="outline-container-orgdde736b" class="outline-4">
<h4 id="orgdde736b"><span class="section-number-4">4.1.3</span> `tput setaf [1-7]` – Set a foreground color using ANSI escape</h4>
</div>
<div id="outline-container-org2f2e408" class="outline-4">
<h4 id="org2f2e408"><span class="section-number-4">4.1.4</span> `tput setf [1-7]` – Set a foreground Color</h4>
</div>
</div>

<div id="outline-container-orgf56e4e1" class="outline-3">
<h3 id="orgf56e4e1"><span class="section-number-3">4.2</span> Text capabilities</h3>
<div class="outline-text-3" id="text-4-2">
</div><div id="outline-container-org7b66ac3" class="outline-4">
<h4 id="org7b66ac3"><span class="section-number-4">4.2.1</span> `tput bold` – Set bold mode</h4>
</div>
<div id="outline-container-org5b6e4ad" class="outline-4">
<h4 id="org5b6e4ad"><span class="section-number-4">4.2.2</span> `tput dim` – turn on half-bright mode</h4>
</div>
<div id="outline-container-org20065fe" class="outline-4">
<h4 id="org20065fe"><span class="section-number-4">4.2.3</span> `tput smul` – begin underline mode</h4>
</div>
<div id="outline-container-orgb5b80ba" class="outline-4">
<h4 id="orgb5b80ba"><span class="section-number-4">4.2.4</span> `tput rmul` – exit underline mode</h4>
</div>
<div id="outline-container-org4d7ba3f" class="outline-4">
<h4 id="org4d7ba3f"><span class="section-number-4">4.2.5</span> `tput rev` – Turn on reverse mode</h4>
</div>
<div id="outline-container-org04ae5c9" class="outline-4">
<h4 id="org04ae5c9"><span class="section-number-4">4.2.6</span> `tput smso` – Enter standout mode (bold on rxvt)</h4>
</div>
<div id="outline-container-org8de2524" class="outline-4">
<h4 id="org8de2524"><span class="section-number-4">4.2.7</span> `tput rmso` – Exit standout mode</h4>
</div>
<div id="outline-container-org3500a5c" class="outline-4">
<h4 id="org3500a5c"><span class="section-number-4">4.2.8</span> `tput sgr0` – Turn off all attributes</h4>
</div>
</div>

<div id="outline-container-org4cdbeb0" class="outline-3">
<h3 id="org4cdbeb0"><span class="section-number-3">4.3</span> Color codes</h3>
<div class="outline-text-3" id="text-4-3">
</div><div id="outline-container-org6acc123" class="outline-4">
<h4 id="org6acc123"><span class="section-number-4">4.3.1</span> `0` – Black</h4>
</div>
<div id="outline-container-org8a87ccd" class="outline-4">
<h4 id="org8a87ccd"><span class="section-number-4">4.3.2</span> `1` – Red</h4>
</div>
<div id="outline-container-orga2e0c61" class="outline-4">
<h4 id="orga2e0c61"><span class="section-number-4">4.3.3</span> `2` – Green</h4>
</div>
<div id="outline-container-org47c4ad9" class="outline-4">
<h4 id="org47c4ad9"><span class="section-number-4">4.3.4</span> `3` – Yellow</h4>
</div>
<div id="outline-container-org7da759f" class="outline-4">
<h4 id="org7da759f"><span class="section-number-4">4.3.5</span> `4` – Blue</h4>
</div>
<div id="outline-container-orgf6a77d7" class="outline-4">
<h4 id="orgf6a77d7"><span class="section-number-4">4.3.6</span> `5` – Magenta</h4>
</div>
<div id="outline-container-org6bf2d12" class="outline-4">
<h4 id="org6bf2d12"><span class="section-number-4">4.3.7</span> `6` – Cyan</h4>
</div>
<div id="outline-container-org19fc77e" class="outline-4">
<h4 id="org19fc77e"><span class="section-number-4">4.3.8</span> `7` – White</h4>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author:  (<a href="mailto:elkorn@arch">elkorn@arch</a>)</p>
<p class="date">Date: </p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 9.0.3)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
